{
  "Home": {
    "navBar": {
      "langs": {
        "description": "Язык приложения",
        "en": "Английский",
        "es": "Испанский",
        "ru": "Русский"
      }
    },
    "logoCard": {
      "title": "это демонстрационный веб-проект."
    },
    "nextjsText": "Next.js является основой этого проекта, предоставляя <highlight>мощную функциональность</highlight> и плавную интеграцию, что упрощает разработку и улучшает <highlight>пользовательский опыт</highlight>.",
    "tailwind": {
      "description": "Tailwind CSS — это исключительная утилита-first CSS фреймворк, который улучшает процесс дизайна и разработки, предоставляя обширный набор предопределенных классов. Он позволяет разработчикам создавать отзывчивые и современные интерфейсы прямо в разметке, обеспечивая согласованное стилизование и быстрое прототипирование. Используя Tailwind CSS, этот проект выигрывает от упрощенного рабочего процесса, минимизируя потребность в пользовательском CSS и позволяя быстро вносить изменения в дизайн. Гибкость и модульность Tailwind позволяют бесшовно интегрироваться с существующими компонентами, поддерживая эстетическую целостность всего приложения."
    },
    "labButton": {
      "title": "Войдите в Lab"
    }
  },
  "Footer": {
    "madeWithLove": "Сделано с ❤️ от <link>@mzzdev</link>",
    "deployedOn": "Развернуто в",
    "accesibility": {
      "title": "Доступность",
      "description": "Meld использует инструменты для улучшения доступности веб-сайта, используя в качестве руководства Руководство по обеспечению доступности веб-контента.",
      "moreInfo": "Больше информации"
    }
  },
  "Lab": {
    "glsl": "Откройте шейдеры WebGL",
    "loader": "Введите загрузчик 3D моделей",
    "home": "Назад на главную"
  },
  "Miniplayer": {
    "reactInfo1": "Работает на React",
    "reactInfo2": "Нажмите, чтобы узнать больше",
    "reactText": "React — это мощная библиотека JavaScript, разработанная Facebook для создания пользовательских интерфейсов, особенно одностраничных приложений. Она позволяет разработчикам создавать повторно используемые UI-компоненты, которые управляют своим собственным состоянием и могут быть скомпонованы для создания сложных пользовательских интерфейсов. Декларативная природа React делает его простым для предсказания и отладки, что повышает производительность разработчика и поддерживаемость кода. Используя виртуальный DOM, React эффективно обновляет и рендерит компоненты при изменении данных, обеспечивая оптимальную производительность. Кроме того, обширная экосистема React, включая хуки, контекст API и интеграцию с другими библиотеками и фреймворками, предоставляет обширные инструменты и гибкость для создания динамичных и отзывчивых веб-приложений. Использование его вместе с Next.js позволяет выполнять серверный рендеринг и генерацию статических сайтов, что дополнительно оптимизирует производительность и SEO для современных веб-проектов.",
    "closeTooltip": "чтобы закрыть"
  },
  "Loader": {
    "goBackButton": "Вернуться",
    "uploadButton": "Загрузить модель",
    "fileTypesMessage": "Перетащите или выберите модель .glb",
    "sampleModelsMessage": "Или выберите образец модели:",
    "dragFileTitleMessage": "Перетащите файл .glb сюда",
    "dragFileBodyMessage": "Отпустите файл для загрузки модели",
    "fileTypeErrorMessage": "Неверный тип файла. Пожалуйста, загрузите файл .glb."
  },
  "GLSL": {
    "goBackButton": "Вернуться",
    "webglDescription": "WebGL (Web Graphics Library) - это JavaScript API для визуализации интерактивной 2D и 3D графики в любом совместимом веб-браузере без использования плагинов. Он позволяет выполнять высокопроизводительную отрисовку сложных графических изображений непосредственно на GPU.",
    "threejsDescription": "Three.js - это легкая библиотека/API JavaScript, используемая для создания и отображения анимированной 3D компьютерной графики в веб-браузере. Она упрощает процесс создания трехмерных визуализаций, игр, интерактивного контента и многого другого.",
    "r3fDescription": "React Three Fiber (r3f) - это рендерер для Three.js в React, позволяющий разработчикам декларативно определять и управлять трехмерными сценами с использованием компонентов React. Он интегрируется на уровне архитектуры компонентов React.",
    "dreiDescription": "Drei - это набор полезных помощников и абстракций для React Three Fiber (r3f), улучшающий опыт разработки при создании трехмерных приложений в React. Предоставляет предварительно созданные компоненты и утилиты для общих задач.",
    "moreInfo": "Дополнительная информация",
    "glslMessage": "Все визуальные элементы были созданы с использованием какой-то формы WebGL."
  }
}